{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"famhistory:0": {"name": "famhistory:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "sleepdr:0": {"name": "sleepdr:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "suicidalth:0": {"name": "suicidalth:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "satisfaction:0": {"name": "satisfaction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "diethabits:0": {"name": "diethabits:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "gender:0": {"name": "gender:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "workorstudent:0": {"name": "workorstudent:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 376}, "pressure:0": {"name": "pressure:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "wshours:0": {"name": "wshours:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "financialstress:0": {"name": "financialstress:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "diethabits", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "famhistory", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "financialstress", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "gender", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "pressure", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "satisfaction", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "sleepdr", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "suicidalth", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "workorstudent", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "wshours", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13", "op": "NoOp", "input": ["^diethabits", "^famhistory", "^unknown", "^financialstress", "^gender", "^pressure", "^satisfaction", "^sleepdr", "^suicidalth", "^wshours", "^workorstudent"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_5", "op": "Cast", "input": ["diethabits", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_9", "op": "Cast", "input": ["famhistory", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_8", "op": "Cast", "input": ["financialstress", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["gender", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["pressure", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_3", "op": "Cast", "input": ["satisfaction", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_4", "op": "Cast", "input": ["sleepdr", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_6", "op": "Cast", "input": ["suicidalth", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_7", "op": "Cast", "input": ["wshours", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["workorstudent", "^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/input_control_node/_13"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_5", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_9", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_8", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_2", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_3", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_4", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_6", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_7", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall/Cast_1"], "attr": {"N": {"i": "10"}, "axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/stack", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "2"}}}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/inference_op", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "629", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzhiNDhkNjE5LWRkNmYtNGMwMC1hY2QzLWVjZmJlZDI2M2Q5M19sb2FkXzE="}, "container": {"s": ""}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^629", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["629", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": ""}, "pattern": {"s": "OTIwMTg0MDBiNmRkNDgyZmRvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "OTIwMTg0MDBiNmRkNDgyZg=="}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1994}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 376}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "629", "shape": [], "dtype": "string"}]}]}